{
    "bagels": {
        "Title": "New York-Style Bagels",
        "Statistics": [
            "Prep: 1 hour, 40 min",
            "Cook: 20 min",
            "Ready in 2 hours",
            "Makes 8 Servings"
        ],
        "Ingredients": [
            "2 tsp (6 g) active dry yeast",
            "4-½ tsp (19 g) granulated sugar",
            "1-¼ cups (300 ml) warm water (±¼ cup)",
            "3-½ cups (440 g) bread flour (±½ cup for kneading)",
            "1-½ tsp (6 g) salt"
        ],
        "Directions": [
            "1. In ½ cup (120 ml) of the warm water, pour in the sugar and yeast. Do not stir. Let it sit for five minutes, and then stir the yeast and sugar mixture until it all dissolves in the water.",
            "2. Mix the flour and salt in a large bowl. Make a well in the middle and pour in the yeast and sugar mixture.",
            "3. Pour ⅓ cup (80ml) of the remaining warm water into the well. Mix and stir in the rest of the water (100 ml) as needed. (Note: Depending on where you live, you may need to add anywhere from a couple tablespoons to about ¼ cup (60ml) of water. You want a moist and firm dough after you have mixed it.)",
            "4. On a floured countertop, knead the dough for about 10 minutes until it is smooth and elastic. Try working in as much flour as possible to form a firm and stiff dough.",
            "5. Alternatively, use the lowest setting on a stand mixer for 5-6 minutes.",
            "6. Lightly brush a large bowl with oil and turn the dough to coat. Cover the bowl with a damp dish towel. Let rise in a warm place for 1 hour, until the dough has doubled in size. Punch the dough down, and let it rest for another 10 minutes.",
            "7. Alternatively, cover and let rise overnight in the refrigerator. The following day, let the dough sit at room temperature for about 30 min before proceeding. Punch the dough down, and let it rest for another 10 minutes.",
            "8. Carefully divide the dough into 8 pieces. Shape each piece into a round. Now, take a dough ball, and press it gently against the countertop (or whatever work surface you’re using) moving your hand and the ball in a circular motion pulling the dough into itself while reducing the pressure on top of the dough slightly until a perfect dough ball forms. Repeat with 7 other dough rounds.",
            "9. Coat a finger in flour, and gently press your finger into the center of each dough ball to form a ring. Stretch the ring to about ⅓ the diameter of the bagel and place on a lightly oiled cookie sheet. Repeat the same step with the remaining dough.",
            "10. After shaping the dough rounds and placing them on the cookie sheet (with enough space in between each one), cover with a damp kitchen towel and allow to rest for 10 minutes (30-45 min for puffier bagels). Meanwhile, preheat your oven to 425ºF (220ºC).",
            "11. Try to handle the shaped dough as little as possible in order to maintain the fluffy texture (dough will collapse if handled too much).",
            "12. Bring a large pot of water to a boil. Reduce the heat to a simmer. Use a slotted spoon or skimmer to lower the bagels into the water. Boil as many as you are comfortable with boiling. Once the bagels are in, it shouldn’t take too long for them to float to the top (a couple seconds). Let them sit there for 1 minute, and then flip them over to boil for another minute. Extend the boiling times to 2 minutes each, if you’d prefer a chewier bagel (results will give you a more New York-Style bagel with this option).",
            "13. For a fluffier bagel, boil 30-45 seconds on each side.",
            "14. If you want to add toppings to your bagels, do so as you take them out of the water. Alternatively, you can use an egg wash to get the toppings to stick before baking the bagels.",
            "15. Once all the bagels have boiled (and have been topped with your choice of toppings), transfer them to an oiled or parchment-lined baking sheet.",
            "16. Bake for 20 - 25 minutes, or until golden brown.",
            "17. Cool on a wire rack."
        ]
    },
    "banana_bread": {
        "Title": "Banana Bread",
        "Statistics": [
            "Prep: 20 min",
            "Cook: 1 hour, 5 min",
            "Ready in 1 hour, 25 min",
            "Makes 12 Servings"
        ],
        "Ingredients": [
            "2 cups all-purpose flour",
            "1 tsp baking soda",
            "¼ tsp salt",
            "½ cup butter",
            "¾ cup brown sugar",
            "2 eggs, beaten",
            "2-⅓ cups mashed overripe bananas (~4-5 bananas)"
        ],
        "Directions": [
            "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.",
            "2. In a large bowl, combine flour, baking soda and salt.",
            "3. In a separate bowl, cream together butter and brown sugar.",
            "4. Stir in eggs and mashed bananas until well blended.",
            "5. Stir banana mixture into flour mixture; stir just to moisten. Fold in additional toppings, if desired. Pour batter into prepared loaf pan.",
            "6. Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."
        ]
    },
    "banana_nut_muffins": {
        "Title": "Banana Nut Muffins",
        "Statistics": [
            "Prep: 15 min",
            "Cook: 30 min",
            "Ready in 45 min",
            "Makes 15 Servings"
        ],
        "Ingredients": [
            "½ cup unsalted butter, melted and cooled slightly",
            "⅔ cup light brown sugar, lightly packed",
            "2 large eggs",
            "2 cups mashed very ripe bananas (about 3-4 bananas)",
            "2 tsp pure vanilla extract",
            "1-¾ cups all purpose flour",
            "1 tsp baking soda",
            "¼ tsp salt",
            "½ tsp ground cinnamon",
            "½ cup chopped nuts (walnuts, macadamia nuts, pecans or hazelnuts)",
            "¼ cup brown sugar",
            "2-3 Tbsp chopped nuts"
        ],
        "Directions": [
            "1. Preheat oven to 350°F.",
            "2. In a large bowl, whisk melted butter and brown sugar until well combined, about 1 full minute.",
            "3. Add eggs, mashed banana and vanilla, whisking until combined.",
            "4. In a separate bowl, combine the flour, baking soda, salt, and cinnamon.",
            "5. Add dry ingredients to the wet ingredients and use a rubber spatula to lightly stir the batter until almost combined.",
            "6. Add ½ cup nuts and stir until no streaks of flour remain. Be careful not to over-mix.",
            "7. Grease 15 standard-sized muffin cups and divide the batter evenly among the cups.",
            "8. Sprinkle the top of each cup with brown sugar and chopped nuts (topping).",
            "9. Bake for 18-25 minutes, until a toothpick inserted into the center comes out clean. Place the pan on a wire rack to cool."
        ]
    },
    "blueberry_muffins": {
        "Title": "Blueberry Muffins",
        "Statistics": [
            "Prep: 15 min",
            "Cook: 30 min",
            "Ready in 45 min",
            "Makes 12 Servings"
        ],
        "Ingredients": [
            "½ cup softened butter",
            "1-¼ cups sugar",
            "2 eggs",
            "1 tsp vanilla extract",
            "2 cups flour",
            "½ tsp salt",
            "2 tsp baking powder",
            "½ cup milk",
            "2 cups blueberries, washed, drained and picked over",
            "3 tsp sugar"
        ],
        "Directions": [
            "1. Preheat the oven to 375 degrees F.",
            "2. Cream the butter and 1-¼ cups sugar until light.",
            "3. Add the eggs, one at a time, beating well after each addition. Add vanilla.",
            "4. Sift together the flour, salt and baking powder, and add to the creamed mixture alternately with the milk.",
            "5. Crush ½ cup blueberries with a fork, and mix into the batter. Fold in the remaining whole berries.",
            "6. Line a 12 cup standard muffin tin with cupcake liners, and fill with batter.",
            "7. Sprinkle the 3 teaspoons sugar over the tops of the muffins, and bake at 375 degrees for about 30-35 minutes.",
            "8. Remove muffins from tin and cool at least 30 minutes. Store, uncovered, or the muffins will be too moist the second day."
        ]
    },
    "brownies": {
        "Title": "Brownies",
        "Statistics": [
            "Prep: 25 min",
            "Cook: 25 min",
            "Ready in 1 hour",
            "Makes 16 Servings"
        ],
        "Ingredients": [
            "½ cup white sugar",
            "2 Tbsp butter",
            "2 Tbsp water",
            "1-½ cup semisweet chocolate chips",
            "2 eggs",
            "½ tsp vanilla extract",
            "⅔ cup all-purpose flour",
            "¼ tsp baking soda",
            "½ tsp salt"
        ],
        "Directions": [
            "1. Preheat the oven to 325 degrees F (165 degrees C). Grease an 8x8 inch square pan.",
            "2. In a medium saucepan, combine the sugar, butter and water. Cook over medium heat until boiling. Remove from heat and stir in chocolate chips until melted and smooth. Mix in the eggs and vanilla. Combine the flour, baking soda and salt; stir into the chocolate mixture. Spread evenly into the prepared pan.",
            "3. Bake for 25 to 30 minutes in the preheated oven, until brownies set up. Do not overbake! Cool in pan and cut into squares."
        ]
    },
    "chocolate_chip_cookie_cake": {
        "Title": "Chocolate Chip Cookie Cake",
        "Statistics": [
            "Prep: 20 min",
            "Cook: 20 min",
            "Ready in 40 min",
            "Makes 8 Servings"
        ],
        "Ingredients": [
            "1-¾ cups (210g) all-purpose flour",
            "¾ tsp baking soda",
            "½ tsp salt",
            "½ cup (113g) unsalted butter, softened",
            "¾ cup (165g) light brown sugar",
            "¼ cup (50g) granulated sugar",
            "1 large egg",
            "2-½ tsp vanilla extract",
            "1-½ cups (270g) semi-sweet chocolate chips, plus more for sprinkling"
        ],
        "Directions": [
            "1. Preheat the oven to 350F. Butter or spray a 9-inch round cake pan with baking spray.",
            "2. In a medium bowl, sift together flour, baking soda, and salt.",
            "3. In a large mixing bowl, beat butter until smooth. Add sugars and beat on medium speed until smooth and well combined, about 2 minutes. (You don’t want to beat the mixture until very light and fluffy like you would for a cake because the air will make the cookie too crumbly and puffy.)",
            "4. Add the egg and vanilla. Beat until well combined, scraping down the sides of the bowl as needed. While mixing on low speed, add the flour and beat just until combined. Fold in the chocolate chips.",
            "5. Press the cookie dough into an even layer in the prepared cake pan. Sprinkle with more chocolate chips if desired.",
            "6. Bake for 20 to 25 minutes or until the cookie is lightly browned and appears dry on the surface. Let cool completely in the pan on a wire rack."
        ]
    },
    "croissants": {
        "Title": "Croissants",
        "Statistics": [
            "Prep: 4 hours, 45 min",
            "Cook: 15 min",
            "Ready in 5 hours",
            "Makes 15 Servings (8 large)"
        ],
        "Ingredients": [
            "4 cups all-purpose flour",
            "⅓ cup granulated sugar",
            "4 tsp active dry yeast",
            "2-¼ tsp kosher salt",
            "1-¼ cups unsalted butter, cold (2-½ sticks)",
            "1 cup milk (you may need slightly more or less) → 1-⅓ to 1-½ cups",
            "egg wash (1 large egg beaten with 1-2 tsp water)"
        ],
        "Directions": [
            "1. Place the flour, sugar, yeast, and salt in a large bowl and whisk together until combined.",
            "2. Slice the butter into 1/8-inch thick slices and toss in the flour mixture to coat.",
            "3. Add the milk and stir together until a stiff dough forms (it should look crumbly).",
            "4. Form the dough into a ball and wrap tightly in plastic wrap. Chill for 1 hour.",
            "5. On a lightly floured surface, roll the dough into a long rectangle shape.",
            "6. Fold it into thirds (like a letter), turn 90 degrees, and repeat 4 to 6 more times, or until the dough has large streaks of butter in it but it is smooth and flat. (If at any point the butter starts to feel soft, chill it in the refrigerator or freezer until stiff.)",
            "7. Wrap tightly and chill for 1 more hour, then divide the dough in half and roll each portion out to a thickness of about 1/8-inch, in a long rectangle shape (approx. 10-inches wide by 22-inches long).",
            "8. Cut the dough into long, skinny triangles (about 5-inches at the wide end).",
            "9. Notch the wide end of each triangle with about a 1/2-inch cut, then roll from the wide end to the pointed end, tucking the point under the croissant. Do not roll too tightly.",
            "10. Place on a parchment-lined baking sheet, cover loosely with plastic wrap, and allow to proof until doubled in size (1 to 2 hours).",
            "11. Preheat the oven to 375 degrees F, and gently brush the croissants with egg wash.",
            "12. Bake for 15 to 20 minutes, or until puffed, golden brown, and flaky. Rotate part-way through to ensure even browning.",
            "13. If the tops are browning too quickly, cover with aluminum foil or parchment paper."
        ]
    },
    "gingersnaps": {
        "Title": "Gingersnap Cookies",
        "Statistics": [
            "Prep: 10 min",
            "Cook: 13 min",
            "Ready in 23 min",
            "Makes 30 Cookies"
        ],
        "Ingredients": [
            "¾ cup butter, room temperature",
            "1 cup granulated sugar",
            "¼ cup unsulphured molasses",
            "1 egg",
            "2 tsp baking soda",
            "½ tsp kosher salt",
            "1-½ tsp ground ginger",
            "1 tsp ground cinnamon",
            "2 cups all purpose flour",
            "2 Tbsp granulated sugar for rolling"
        ],
        "Directions": [
            "1. Preheat oven to 350°F. Line a baking sheet with parchment paper and set aside.",
            "2. In the bowl of your stand mixer fitted with the paddle attachment, mix the butter and sugar together on medium speed for 2 minutes. Add in the molasses, egg, baking soda, salt, ginger, and cinnamon. Mix for another 1 minute, scraping the sides of the bowl as necessary.",
            "3. Turn the mixer to low and add in the flour. Mix until just combined.",
            "4. Place the remaining sugar in a small bowl, set aside.",
            "5. Using a medium (2- tablespoon sized) cookie scoop portion out dough. Roll the dough into balls and then roll the balls in the sugar. Place on the prepared baking sheet 2- inches apart.",
            "6. Bake for 12-14 minutes until the edges are lightly golden and appear “crinkly”.",
            "7. Transfer to a wire rack and cool completely."
        ]
    },
    "lemon_cheesecake": {
        "Title": "Lemon Cheesecake",
        "Statistics": [
            "Prep: 20 min",
            "Cook: 1 hour, 15 min",
            "Ready in 5 hour, 30 min",
            "Makes 8 Servings"
        ],
        "Ingredients": [
            "1-½ cups graham cracker crumbs",
            "6 Tbsp butter, melted",
            "16 oz (2 blocks) full-fat cream cheese, room temperature",
            "⅔ cup granulated sugar",
            "2 eggs, room temperature",
            "1 tsp vanilla extract",
            "2 Tbsp (30 ml) fresh lemon juice (about 1 lemon)",
            "1 tsp finely grated lemon zest",
            "2 Tbsp (25-28 g) sugar",
            "2 egg yolks",
            "1-½ Tbsp (21 g) unsalted butter + a pinch salt"
        ],
        "Directions": [
            "1. Combine all the ingredients in a double boiler (or in a metal bowl over a pot of simmering water).",
            "2. Heat while whisking constantly until mixture thickens and reaches 160 degrees, or coats the back of a spoon.",
            "3. Pour the lemon curd into a heat proof bowl, cover with clear wrap pressed onto the the top of the curd to avoid a film developing, and refrigerate until cold.",
            "4. Preheat oven to 325F. Wrap the outside of a 6x2 or 6x3 springform pan with foil and grease the inside.",
            "5. In a large bowl, mix together the graham cracker crumbs and melted butter. Pat into the bottom and up the sides of the springform pan.",
            "6. In a large mixing bowl, beat together the cream cheese and sugar until light and fluffy, about 2-3 minutes. Scrape down the bowl as needed.",
            "7. Beat in the eggs, one at a time, for 1 minute each or until smooth (do not overbeat). Beat in the vanilla.",
            "8. Transfer the batter to the crust (if using a 6x2 pan, it'll fill to the top). Place the pan inside an 8x8 or larger pan.",
            "9. Pour hot water into the outside pan until the springform pan is halfway submerged in the water. Be careful you don't get water inside the foil.",
            "10. Bake for 50-75 minutes or until the edges are set and brown, the center is mostly set with some wiggling, and internal temperature reaches 150F degrees.",
            "11. Remove from the oven and carefully run a knife along the edge to loosen the cheesecake. Cool 15 minutes in the water bath.",
            "12. Remove the pan from the water bath and let cool at room temperature for 1 hour.",
            "13. Cover and refrigerate at least 4 hours or overnight before garnishing and serving. Store leftovers in an airtight container in the refrigerator for up to 5-7 days."
        ]
    },
    "madeleines": {
        "Title": "Madeleines",
        "Statistics": [
            "Prep: 1 hour, 20 min",
            "Cook: 10 min",
            "Ready in 1 hour, 30 min",
            "Makes 20 Servings"
        ],
        "Ingredients": [
            "7 Tbsp (100g) unsalted butter",
            "2 large eggs, room temperature",
            "½ cup (100g) granulated sugar",
            "1 tsp pure vanilla extract",
            "1 tsp lemon zest (Optional)",
            "¾ cup + 1 Tbsp (100g) all-purpose flour, sifted",
            "¼ tsp baking powder",
            "1 pinch salt"
        ],
        "Directions": [
            "1. Melt the butter either in your microwave or in a small pot over medium heat. Once melted or browned pour the butter into a bowl and allow to cool.",
            "2. Browning the butter will add depth of flavor to the cakes but is optional. To brown the butter, cook until it takes on a caramel color, stirring occasionally.",
            "3. Sift the flour, salt, and baking powder into a bowl then whisk together and set aside.",
            "4. Add the eggs and sugar to the bowl of your stand mixer fitted with a whisk attachment or a large bowl if using an electric hand mixer. Beat on high until the mixture is a light yellow color with a thick silky texture, about 8-9 minutes.",
            "5. You'll see the beater leave trails when it's ready.",
            "6. Mix in the vanilla and lemon zest toward the end.",
            "7. Fold the dry ingredients into the egg mixture and mix until just combined.",
            "8. You can sift the flour mixture into the eggs while you fold to avoid getting lumps or over-mixing the delicate batter.",
            "9. Drizzle the butter into the batter and gently mix until just combined.",
            "10. Cover and chill the batter as well as the buttered tins for 1 hour then scoop one tablespoon of batter into each scallop-shaped well.",
            "11. Bake at 350F for 8-10 minutes. The edges will be golden and the centers should spring back if pressed lightly. Allow to cool in pans for a few minutes before removing to cool completely.",
            "12. Serve with a light dusting of powdered sugar."
        ]
    },
    "maple_pumpkin_cookies": {
        "Title": "Maple Brown Butter Pumpkin Cookies",
        "Statistics": [
            "Prep: 35 min",
            "Cook: 15 min",
            "Ready in 50 min",
            "Makes 12 Servings"
        ],
        "Ingredients": [
            "1 cup (220 g) unsalted butter",
            "1-½ cups (280 g) dark brown sugar, packed",
            "1 egg yolk",
            "3 Tbsp pure maple syrup",
            "1 tsp vanilla extract",
            "⅓ cup (80 g) pumpkin puree",
            "2-¼ cups (280 g) all purpose flour",
            "1 tsp baking soda",
            "½ tsp baking powder",
            "½ tsp salt",
            "1-½ tsp pumpkin pie spice",
            "½ tsp cinnamon",
            "2 Tbsp brown sugar",
            "2 Tbsp granulated sugar",
            "1 tsp cinnamon"
        ],
        "Directions": [
            "1. First, brown the butter. Melt 1 cup of butter over medium heat, continuing to stir until it reaches a rich amber color.",
            "2. Pour the butter into a measuring glass to ensure you have the right amount, making sure to scrape the bottom of the pot to get all of the brown bits as well. It should be a bit short of 1 cup. Place in the refrigerator to chill for about 20 minutes. Don’t let it solidify.",
            "3. Preheat the oven to 350F and line a large baking sheet with parchment paper.",
            "4. In a medium bowl, whisk together the flour, baking soda, baking powder, salt, and spices. Set aside.",
            "5. In a large mixing bowl, whisk together the brown sugar and cooled brown butter. It should look like clumpy wet sand.",
            "6. Whisk in the egg yolk, maple syrup, vanilla, and pumpkin until smooth.",
            "7. Add in all of the dry ingredients and use a rubber spatula to fold into the batter.",
            "8. Off to the side, mix together the coating ingredients in a small dish.",
            "9. Use a large cookie scoop (2 oz) or ¼ measuring cup and scoop out the dough. Drop into the cinnamon sugar mixture and toss to coat. The dough will be very soft but not sticky.",
            "10. Place onto the baking sheet, spaced about 3 inches apart from each other. You should be able to bake 5-6 cookies at a time. Leave the rest of the dough out at room temperature.",
            "11. Bake for 12-15 minutes or until the edges are darkened and the center looks puffed and slightly underdone.",
            "12. Allow them to rest on the baking sheet for a couple minutes, then transfer to a cooling rack. Continue to bake the rest of the cookie dough.",
            "13. Allow the cookies to cool, then dig in!"
        ]
    },
    "oatmeal_chocolate_chip_cookies": {
        "Title": "Oatmeal Chocolate Chip Cookies",
        "Statistics": [
            "Prep: 30 min",
            "Cook: 15 min",
            "Ready in 45 min",
            "Makes 21 Servings"
        ],
        "Ingredients": [
            "½ cup butter, softened",
            "¾ cup packed light brown sugar",
            "¼ cup white sugar",
            "1 eggs",
            "1 tsp vanilla extract",
            "1 cup all-purpose flour",
            "½ tsp baking powder",
            "¼ tsp salt",
            "1 tsp cinnamon",
            "1-½ cups quick-cooking oats",
            "½ cup semisweet chocolate chips"
        ],
        "Directions": [
            "1. Preheat the oven to 335 degrees F.",
            "2. In a large bowl, cream together the butter, brown sugar, and white sugar until smooth, light, and fluffy.",
            "3. Beat in egg, then stir in vanilla.",
            "4. Combine the flour, baking soda, salt, and cinnamon; stir into the creamed mixture until just blended.",
            "5. Mix in the quick oats and chocolate chips.",
            "6. Chill dough in the freezer for 10 min or in the fridge for 30 min.",
            "7. Drop by heaping spoonfuls onto ungreased baking sheets.",
            "8. Bake for 12 minutes in the preheated oven.",
            "9. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."
        ]
    }
}