{
    "Title": "New York-Style Bagels",
    "Statistics": [
        "Prep: 1 hour, 40 min",
        "Cook: 20 min",
        "Ready in 2 hours",
        "Makes 8 Servings"
    ],
    "Ingredients": [
        "2 tsp (6 g) active dry yeast",
        "4-½ tsp (19 g) granulated sugar",
        "1-¼ cups (300 ml) warm water (±¼ cup)",
        "3-½ cups (440 g) bread flour (±½ cup for kneading)",
        "1-½ tsp (6 g) salt"
    ],
    "Directions": [
        "1. In ½ cup (120 ml) of the warm water, pour in the sugar and yeast. Do not stir. Let it sit for five minutes, and then stir the yeast and sugar mixture until it all dissolves in the water.",
        "2. Mix the flour and salt in a large bowl. Make a well in the middle and pour in the yeast and sugar mixture.",
        "3. Pour ⅓ cup (80ml) of the remaining warm water into the well. Mix and stir in the rest of the water (100 ml) as needed. (Note: Depending on where you live, you may need to add anywhere from a couple tablespoons to about ¼ cup (60ml) of water. You want a moist and firm dough after you have mixed it.)",
        "4. On a floured countertop, knead the dough for about 10 minutes until it is smooth and elastic. Try working in as much flour as possible to form a firm and stiff dough.",
        "5. Alternatively, use the lowest setting on a stand mixer for 5-6 minutes.",
        "6. Lightly brush a large bowl with oil and turn the dough to coat. Cover the bowl with a damp dish towel. Let rise in a warm place for 1 hour, until the dough has doubled in size. Punch the dough down, and let it rest for another 10 minutes.",
        "7. Alternatively, cover and let rise overnight in the refrigerator. The following day, let the dough sit at room temperature for about 30 min before proceeding. Punch the dough down, and let it rest for another 10 minutes.",
        "8. Carefully divide the dough into 8 pieces. Shape each piece into a round. Now, take a dough ball, and press it gently against the countertop (or whatever work surface you’re using) moving your hand and the ball in a circular motion pulling the dough into itself while reducing the pressure on top of the dough slightly until a perfect dough ball forms. Repeat with 7 other dough rounds.",
        "9. Coat a finger in flour, and gently press your finger into the center of each dough ball to form a ring. Stretch the ring to about ⅓ the diameter of the bagel and place on a lightly oiled cookie sheet. Repeat the same step with the remaining dough.",
        "10. After shaping the dough rounds and placing them on the cookie sheet (with enough space in between each one), cover with a damp kitchen towel and allow to rest for 10 minutes (30-45 min for puffier bagels). Meanwhile, preheat your oven to 425ºF (220ºC).",
        "11. Try to handle the shaped dough as little as possible in order to maintain the fluffy texture (dough will collapse if handled too much).",
        "12. Bring a large pot of water to a boil. Reduce the heat to a simmer. Use a slotted spoon or skimmer to lower the bagels into the water. Boil as many as you are comfortable with boiling. Once the bagels are in, it shouldn’t take too long for them to float to the top (a couple seconds). Let them sit there for 1 minute, and then flip them over to boil for another minute. Extend the boiling times to 2 minutes each, if you’d prefer a chewier bagel (results will give you a more New York-Style bagel with this option).",
        "13. For a fluffier bagel, boil 30-45 seconds on each side.",
        "14. If you want to add toppings to your bagels, do so as you take them out of the water. Alternatively, you can use an egg wash to get the toppings to stick before baking the bagels.",
        "15. Once all the bagels have boiled (and have been topped with your choice of toppings), transfer them to an oiled or parchment-lined baking sheet.",
        "16. Bake for 20 - 25 minutes, or until golden brown.",
        "17. Cool on a wire rack."
    ]
}