{
    "Title": "Croissants",
    "Statistics": [
        "Prep: 4 hours, 45 min",
        "Cook: 15 min",
        "Ready in 5 hours",
        "Makes 15 Servings (8 large)"
    ],
    "Ingredients": [
        "4 cups all-purpose flour",
        "⅓ cup granulated sugar",
        "4 tsp active dry yeast",
        "2-¼ tsp kosher salt",
        "1-¼ cups unsalted butter, cold (2-½ sticks)",
        "1 cup milk (you may need slightly more or less) → 1-⅓ to 1-½ cups",
        "egg wash (1 large egg beaten with 1-2 tsp water)"
    ],
    "Directions": [
        "1. Place the flour, sugar, yeast, and salt in a large bowl and whisk together until combined.",
        "2. Slice the butter into 1/8-inch thick slices and toss in the flour mixture to coat.",
        "3. Add the milk and stir together until a stiff dough forms (it should look crumbly).",
        "4. Form the dough into a ball and wrap tightly in plastic wrap. Chill for 1 hour.",
        "5. On a lightly floured surface, roll the dough into a long rectangle shape.",
        "6. Fold it into thirds (like a letter), turn 90 degrees, and repeat 4 to 6 more times, or until the dough has large streaks of butter in it but it is smooth and flat. (If at any point the butter starts to feel soft, chill it in the refrigerator or freezer until stiff.)",
        "7. Wrap tightly and chill for 1 more hour, then divide the dough in half and roll each portion out to a thickness of about 1/8-inch, in a long rectangle shape (approx. 10-inches wide by 22-inches long).",
        "8. Cut the dough into long, skinny triangles (about 5-inches at the wide end).",
        "9. Notch the wide end of each triangle with about a 1/2-inch cut, then roll from the wide end to the pointed end, tucking the point under the croissant. Do not roll too tightly.",
        "10. Place on a parchment-lined baking sheet, cover loosely with plastic wrap, and allow to proof until doubled in size (1 to 2 hours).",
        "11. Preheat the oven to 375 degrees F, and gently brush the croissants with egg wash.",
        "12. Bake for 15 to 20 minutes, or until puffed, golden brown, and flaky. Rotate part-way through to ensure even browning.",
        "13. If the tops are browning too quickly, cover with aluminum foil or parchment paper."
    ]
}