{
    "Title": "Lemon Cheesecake",
    "Statistics": [
        "Prep: 20 min",
        "Cook: 1 hour, 15 min",
        "Ready in 5 hour, 30 min",
        "Makes 8 Servings"
    ],
    "Ingredients": [
        "1-½ cups graham cracker crumbs",
        "6 Tbsp butter, melted",
        "16 oz (2 blocks) full-fat cream cheese, room temperature",
        "⅔ cup granulated sugar",
        "2 eggs, room temperature",
        "1 tsp vanilla extract",
        "2 Tbsp (30 ml) fresh lemon juice (about 1 lemon)",
        "1 tsp finely grated lemon zest",
        "2 Tbsp (25-28 g) sugar",
        "2 egg yolks",
        "1-½ Tbsp (21 g) unsalted butter + a pinch salt"
    ],
    "Directions": [
        "1. Combine all the ingredients in a double boiler (or in a metal bowl over a pot of simmering water).",
        "2. Heat while whisking constantly until mixture thickens and reaches 160 degrees, or coats the back of a spoon.",
        "3. Pour the lemon curd into a heat proof bowl, cover with clear wrap pressed onto the the top of the curd to avoid a film developing, and refrigerate until cold.",
        "4. Preheat oven to 325F. Wrap the outside of a 6x2 or 6x3 springform pan with foil and grease the inside.",
        "5. In a large bowl, mix together the graham cracker crumbs and melted butter. Pat into the bottom and up the sides of the springform pan.",
        "6. In a large mixing bowl, beat together the cream cheese and sugar until light and fluffy, about 2-3 minutes. Scrape down the bowl as needed.",
        "7. Beat in the eggs, one at a time, for 1 minute each or until smooth (do not overbeat). Beat in the vanilla.",
        "8. Transfer the batter to the crust (if using a 6x2 pan, it'll fill to the top). Place the pan inside an 8x8 or larger pan.",
        "9. Pour hot water into the outside pan until the springform pan is halfway submerged in the water. Be careful you don't get water inside the foil.",
        "10. Bake for 50-75 minutes or until the edges are set and brown, the center is mostly set with some wiggling, and internal temperature reaches 150F degrees.",
        "11. Remove from the oven and carefully run a knife along the edge to loosen the cheesecake. Cool 15 minutes in the water bath.",
        "12. Remove the pan from the water bath and let cool at room temperature for 1 hour.",
        "13. Cover and refrigerate at least 4 hours or overnight before garnishing and serving. Store leftovers in an airtight container in the refrigerator for up to 5-7 days."
    ]
}