{
    "Title": "Madeleines",
    "Statistics": [
        "Prep: 1 hour, 20 min",
        "Cook: 10 min",
        "Ready in 1 hour, 30 min",
        "Makes 20 Servings"
    ],
    "Ingredients": [
        "7 Tbsp (100g) unsalted butter",
        "2 large eggs, room temperature",
        "½ cup (100g) granulated sugar",
        "1 tsp pure vanilla extract",
        "1 tsp lemon zest (Optional)",
        "¾ cup + 1 Tbsp (100g) all-purpose flour, sifted",
        "¼ tsp baking powder",
        "1 pinch salt"
    ],
    "Directions": [
        "1. Melt the butter either in your microwave or in a small pot over medium heat. Once melted or browned pour the butter into a bowl and allow to cool.",
        "2. Browning the butter will add depth of flavor to the cakes but is optional. To brown the butter, cook until it takes on a caramel color, stirring occasionally.",
        "3. Sift the flour, salt, and baking powder into a bowl then whisk together and set aside.",
        "4. Add the eggs and sugar to the bowl of your stand mixer fitted with a whisk attachment or a large bowl if using an electric hand mixer. Beat on high until the mixture is a light yellow color with a thick silky texture, about 8-9 minutes.",
        "5. You'll see the beater leave trails when it's ready.",
        "6. Mix in the vanilla and lemon zest toward the end.",
        "7. Fold the dry ingredients into the egg mixture and mix until just combined.",
        "8. You can sift the flour mixture into the eggs while you fold to avoid getting lumps or over-mixing the delicate batter.",
        "9. Drizzle the butter into the batter and gently mix until just combined.",
        "10. Cover and chill the batter as well as the buttered tins for 1 hour then scoop one tablespoon of batter into each scallop-shaped well.",
        "11. Bake at 350F for 8-10 minutes. The edges will be golden and the centers should spring back if pressed lightly. Allow to cool in pans for a few minutes before removing to cool completely.",
        "12. Serve with a light dusting of powdered sugar."
    ]
}